recipes/cobb-salad.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cobb Salad</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Cobb Salad</h1>
<p>
<a href="https://www.connoisseurusveg.com/vegan-cobb-salad/">Original link</a>
</p>

<div id="outline-container-org026032b" class="outline-2">
<h2 id="org026032b">Ingredients</h2>
<div class="outline-text-2" id="text-org026032b">
</div>
<div id="outline-container-org7d4ef6b" class="outline-3">
<h3 id="org7d4ef6b">For the Dressing:</h3>
<div class="outline-text-3" id="text-org7d4ef6b">
<ul class="org-ul">
<li>2 tablespoons minced shallot (about 1 small shallot)</li>
<li>1/4 cup olive oil</li>
<li>1/4 cup red wine vinegar</li>
<li>1/4 cup water</li>
<li>1 tablespoon Dijon mustard</li>
<li>2 teaspoons maple syrup</li>
<li>1/2 teaspoon salt, or to taste</li>
<li>1/4 teaspoon black pepper, or to taste</li>
</ul>
</div>
</div>

<div id="outline-container-org5e6560d" class="outline-3">
<h3 id="org5e6560d">For the Eggy Tofu:</h3>
<div class="outline-text-3" id="text-org5e6560d">
<ul class="org-ul">
<li>1/4 teaspoon turmeric</li>
<li>1/4 teaspoon garlic powder</li>
<li>1/4 teaspoon kala namak (black salt)</li>
<li>1/4 teaspoon black pepper</li>
<li>1 tablespoon olive oil</li>
<li>200g extra-firm tofu, drained, pressed and cut into 1/2 inch cubes</li>
<li>2 teaspoons lemon juice</li>
</ul>
</div>
</div>

<div id="outline-container-org763b13f" class="outline-3">
<h3 id="org763b13f">For the Salad:</h3>
<div class="outline-text-3" id="text-org763b13f">
<ul class="org-ul">
<li>1 small head romaine lettuce, cleaned and chopped</li>
<li>1 small head bibb lettuce, cleaned and chopped</li>
<li>1 large tomato diced</li>
<li>1 cup cooked chickpeas</li>
<li>1 avocado sliced</li>
<li>1 cup <a href="./coconut-bacon.html">coconut bacon</a></li>
<li>Salt and pepper to taste</li>
<li>2 tablespoons chopped fresh chives</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9286e0d" class="outline-2">
<h2 id="org9286e0d">Method</h2>
<div class="outline-text-2" id="text-org9286e0d">
<ol class="org-ol">
<li>Begin by whisking all of the dressing ingredients together in a small bowl or jar. Allow it to sit while you prepare the rest of the salad.</li>
<li>To make the eggy tofu, first stir the turmeric, garlic powder, kala namak and pepper together in a small bowl.</li>
<li>Coat the bottom of a medium skillet with olive oil and place it over medium heat.</li>
<li>When the oil is hot, add the tofu and cook for about 10 minutes, flipping once or twice to achieve browning on multiple sides.</li>
<li>Sprinkle the tofu with the lemon juice and flip a few times to coat.</li>
<li>Sprinkle the turmeric mixture over the tofu and toss a few times to coat.</li>
<li>Remove the skillet from the heat and transfer the tofu to a plate.</li>
<li>Fill a large salad bowl with the lettuce (or divide it among 4 individual bowls).</li>
<li>Arrange the toppings over the lettuce, then sprinkle with salt, pepper and chives.</li>
<li>Drizzle with dressing and serve.</li>
</ol>
</div>
</div>

<div id="outline-container-org9b8282d" class="outline-2">
<h2 id="org9b8282d">Nutrition</h2>
<div class="outline-text-2" id="text-org9b8282d">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nutrition info</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Servings: 4.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Per serve:</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Energy</b></td>
<td class="org-left">2236 kJ</td>
</tr>

<tr>
<td class="org-left"><b>Total fat</b></td>
<td class="org-left">44 g</td>
</tr>

<tr>
<td class="org-left">Saturated</td>
<td class="org-left">12 g</td>
</tr>

<tr>
<td class="org-left"><b>Sodium</b></td>
<td class="org-left">795 mg</td>
</tr>

<tr>
<td class="org-left"><b>Total carbs</b></td>
<td class="org-left">36 g</td>
</tr>

<tr>
<td class="org-left">Dietary fibre</td>
<td class="org-left">10 g</td>
</tr>

<tr>
<td class="org-left">Sugars</td>
<td class="org-left">8 g</td>
</tr>

<tr>
<td class="org-left"><b>Protein</b></td>
<td class="org-left">13 g</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>
